app/Repositories/Orders/BaseOrderRepository.php

insert into `orders` (`restorant_id`, `comment`, `payment_method`, `payment_status`, `tips`, `checkoutCustomTipsField`, `checkout_phone_field`, `checkout_customer_email_field`, `delivery_method`, `client_id`, `updated_at`, `created_at`) values (1, '', 'cod', 'unpaid', '10', '', '', 'testing.test3215@gmail.com', 3, 2, '2022-05-03 09:42:27', '2022-05-03 09:42:27')
select * from `orders` where `id` = 880 and `orders`.`deleted_at` is null and `restorant_id` = 1
select * from `orders` where `id` = 902 and `orders`.`deleted_at` is null
select * from `tables` where `id` = '4'
select * from `tables` where `id` = '2'
select * from `restoareas` where `id` = 1
---
    private function createOrder(){


        if($this->order==null){

            $this->order=new Order;
            $this->order->restorant_id=$this->vendor->id;
            $this->order->comment="";
            $this->order->payment_method=$this->request->payment_method;
            $this->order->payment_status="unpaid";
            $this->order->tips=$this->request->tips;

            //$this->order->checkout_phone_field=$this->request->checkout_phone_field;
            $this->order->checkout_phone_field=$this->request->checkout_phone;
            $this->order->checkout_customer_email_field=$this->request->checkout_customer_email_field;
            $comment=$this->request->comment;

            $expeditionsTypes=['delivery'=>1,'pickup'=>2,'dinein'=>3]; //1- delivery 2 - pickup 3-dinein
            $this->order->delivery_method=$expeditionsTypes[$this->expedition];

            //Client
            if(auth()->user()){
                $this->order->client_id=auth()->user()->id;
            }

            // $this->order->order_price=0;
            // $this->order->vatvalue=0;

            //Save order
            $this->order->save();
            $last_order_id =  $this->order->id;
            $subtotal = $this->request->checkout_subtotal_field;

            $last_order =Order::where('id', $last_order_id)->get();
            $table_id =$this->request->dinein_table_id;
            $table_name =Tables::where('id', $table_id)->get();

            $restoarea =RestoArea::where('id', $table_name[0]->restoarea_id)->get();

select * from `users` where `id` = 2 and `users`.`deleted_at` is null
---



            $user= User::where('id', $restorant[0]->user_id)->get();

select * from `orders` where `id` in ('896', '897', '898', '900', '901') and `orders`.`deleted_at` is null order by `id` desc
---

            $previousOrders = Cookie::get('orders') ? Cookie::get('orders') : '';
            $previousOrderArray = array_filter(explode(',', $previousOrders));
            $orders = Order::whereIn('id', $previousOrderArray)->orderBy('id', 'desc')->get();

update `orders` set `md` = 'ede7e2b6d13a41ddf9f4bdef84fdc737', `orders`.`updated_at` = '2022-05-03 06:45:31' where `id` = 867
---
        });

            $this->order->md=md5($this->order->id);
            $this->order->update();

select `items`.*, `order_has_items`.`order_id` as `pivot_order_id`, `order_has_items`.`item_id` as `pivot_item_id`, `order_has_items`.`qty` as `pivot_qty`, `order_has_items`.`extras` as `pivot_extras`, `order_has_items`.`vat` as `pivot_vat`, `order_has_items`.`vatvalue` as `pivot_vatvalue`, `order_has_items`.`variant_price` as `pivot_variant_price`, `order_has_items`.`variant_name` as `pivot_variant_name`, `order_has_items`.`id` as `pivot_id`, `order_has_items`.`item_comment` as `pivot_item_comment` from `items` inner join `order_has_items` on `items`.`id` = `order_has_items`.`item_id` where `order_has_items`.`order_id` = 867
---
        //After we have updated the list of items, we need to update the order price
        $order_price=0;
        $total_order_vat=0;
        foreach ($this->order->items()->get() as $key => $item) {

update `orders` set `order_price` = 9.99, `vatvalue` = 2.1, `orders`.`updated_at` = '2022-05-03 06:45:31' where `id` = 867
---


        //Update the order with the item
        $this->order->update();

update `orders` set `comment` = ' ', `orders`.`updated_at` = '2022-05-03 06:45:31' where `id` = 867
---
    private function setComment(){

        $comment = $this->request->comment ? strip_tags($this->request->comment.'') : '';
        $this->order->comment = $this->order->comment.' '.$comment;
        $this->order->update();

update `orders` set `static_fee` = 0, `fee` = 0, `fee_value` = 0, `orders`.`updated_at` = '2022-05-03 06:45:31' where `id` = 867
---
    private function calculateFees(){
        $this->order->static_fee=$this->vendor->static_fee;
        $this->order->fee=$this->vendor->fee;
        $this->order->fee_value=($this->vendor->fee/100)*($this->order->order_price_with_discount-$this->vendor->static_fee);
        $this->order->update();