app/Http/Controllers/RestorantController.php

select * from `localmenus` where `localmenus`.`restaurant_id` = 1 and `localmenus`.`restaurant_id` is not null
---
    public function edit(Restorant $restaurant)
    {

        //Days of the week
        $timestamp = strtotime('next Monday');
        for ($i = 0; $i < 7; $i++) {
            $days[] = strftime('%A', $timestamp);
            $timestamp = strtotime('+1 day', $timestamp);
        }

        //Generate days columns
        $hoursRange = ['id'];
        for ($i = 0; $i < 7; $i++) {
            $from = $i.'_from';
            $to = $i.'_to';

            array_push($hoursRange, $from);
            array_push($hoursRange, $to);
        }





        //Languages
        $available_languages=[];
        $default_language=null;

        try {
            if($restaurant->localMenus()->get()){
                $available_languages=$restaurant->localMenus()->get()->pluck('languageName','id');
                foreach ($restaurant->localMenus()->get() as $key => $localMenu) {